---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.DividedSurfaceFailures.DividedSurfaceCuttingSurfaceMakesMultipleCuts
source: html/eb6f1f59-8be9-41f7-9200-7b7b8540b32b.htm
---
# Autodesk.Revit.DB.BuiltInFailures.DividedSurfaceFailures.DividedSurfaceCuttingSurfaceMakesMultipleCuts Property

The surface-based splitter intersects a face to be divided in multiple places and this case is not currently supported

## Syntax (C#)
```csharp
public static FailureDefinitionId DividedSurfaceCuttingSurfaceMakesMultipleCuts { get; }
```